/** \file
Данный файл содержит в себе функцию AllProverka()
*/


#ifndef ALLPROVERKA
#define ALLPROVERKA


/**
    \brief Функция AllProverka() предназначена для проверки алгоритма, который рассчитывает корни квадратного уравнения. 

    AllProverka() по требованию пользователя запускает UnitTest. Если UnitTest запустился и выполнился успешно (без ошибок),
    функция сообщает об этом. Иначе выводятся подробные сообщения о тестах, в которых допущены ошибки.
     
*/


void AllProverka ();

#endif
