/** \file
Данный файл содержит в себе функцию CheckAlgorithm()
*/

#ifndef CHECKALGORITHM
#define CHECKALGORITHM

/**
    \brief Функция CheckAlgorithm() предназначена для проверки алгоритма, который рассчитывает корни квадратного уравнения. 

    CheckAlgorithm() по требованию пользователя запускает UnitTest. Если UnitTest запустился и выполнился успешно (без ошибок),
    функция сообщает об этом. Иначе выводятся подробные сообщения о тестах, в которых допущены ошибки.
     
*/

void CheckAlgorithm ();

#endif
